#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>

int main()
{
	//关于➗
	int a = 3 / 5;
	printf("%d\n", a);//0,因为整形计算取整
    float a0 = 6.0 / 5;
	printf("%f\n", a0);//只有一方写成浮点型才能得到小数

	//关于移位进制符
	//把二进制位向左/右移动一位
	int a1 = 2;
	int b = a1 << 1;
	printf("%d\n", b);//4
	//右移操作符
	//算术右移：右边丢弃，左边补原符号位
	//逻辑右移：右边丢弃，补0
	//关于整数的二进制表示形式三种，详见笔记
	int a2 = -1;
	//把a的二进制位向右移动1位
	int b1 = a2 >> 1;
	//当前的右移操作符使用的：算术右移//一般采用算术
	printf("b1 = %d\n", b1);
	//对于操作符，不要移动负数位

	    int a3 = 3;
		int b2 = 5;
	
		//^  - 按（2进制）位异或
		//对应的二进制位进行异或
		//规则：相同为0，相异为1
	
		int c = a3 ^ b2;
		printf("%d\n", c);
	
		//00000000000000000000000000000011
		//00000000000000000000000000000101
		//00000000000000000000000000000110
		//6
	
	
		//  | - 按（2进制）位或
		int c1 = a3 | b2;
		printf("%d\n", c1);
	
		//00000000000000000000000000000011
		//00000000000000000000000000000101
		//00000000000000000000000000000111看上下位数差异11取1 10取1等等
		 
		//& -  按（2进制）位与
		int c2 = a3 & b2;
		printf("c = %d\n", c2);
		//
		//00000000000000000000000000000011
		//00000000000000000000000000000101
		//00000000000000000000000000000001
	
		//不使用第三个变量
		int a4 = 3;
		int b3 = 5;
		//交换
		// 
		printf("a4=%d b3=%d\n", a4, b3);
		a4 = a4 ^ b3;
		b3 = a4 ^ b3;
		a4 = a4 ^ b3;
		printf("a4=%d b3=%d\n", a3, b3);
	
		//printf("a = %d b = %d\n", a, b);
		//数值太大会溢出
		//a4 = a4 + b3;
		//b3 = a4 - b3;
		//a4 = a4 - b3;
		//printf("a4 = %d b3 = %d\n", a, b3);

		//写代码求出一个整形补码中1的个数
         //00000000000000000000000000001101
	     //00000000000000000000000000000001
	     //00000000000000000000000000000001

		//复合赋值与连续赋值

		//单目操作符-只有一个操作符

		short s = 5;
		int a5 = 10;
		printf("%d\n", sizeof(s = a5 + 2));//
		printf("%d\n", s);//
		
		//int a = 10;
		//int arr[10] = { 0 };
		//printf("%d\n", sizeof(arr));//单位是字节
		//printf("%d\n", sizeof(int [10]));//40 - int [10]是arr数组的类型
	    
		//printf("%d\n", sizeof(a));//计算a所占空间的大小，单位是字节
		//printf("%d\n", sizeof(int));
		//printf("%d\n", sizeof a);
		//sizeof是一个操作符，不是函数

		//~按位取反，包括符号位

		//int a = 10;
		//	printf("%p\n", &a);//& - 取地址操作符
		//	int * pa = &a;//pa是用来存放地址的 - pa就是一个指针变量
		//	*pa = 20;//* - 解引用操作符 - 间接访问操作符
		//	printf("%d\n", a);//20

		//强制类型转换
		//int a = (int)3.14;

		//比较两个字符串是否相等不能用==

		//    int i = 0, a = 0, b = 2, c = 3, d = 4;
//    //i = a++ && ++b && d++;//当一边确定为0就不再计算剩下的
//    i = a++ || ++b || d++;
//    printf("a = %d\nb = %d\nc = %d\nd =%d\n", a, b, c, d);

		int arr[10] = { 1,2,3,4,5,6,7,8,9,10 };
		//	//              0 1     4
		//	printf("%d\n", arr[4]);//[] - 就是下标引用操作符
		//	//[] 的操作数是2个：arr , 4
		//	// 
		//	//3+5；

		//关于整型提升见笔记
		//	char a = 3;
//      //00000000000000000000000000000011
//	//00000011 - a
//	char b = 127;
//	//00000000000000000000000001111111
//	//01111111 - b
//
//	char c = a + b;
//	//00000000000000000000000000000011
//	//00000000000000000000000001111111
//	//00000000000000000000000010000010
//	
//	//10000010 - c
//	//11111111111111111111111110000010 - 补码
//	//11111111111111111111111110000001 - 反码
//	//10000000000000000000000001111110 - 原码
//	//-126
//	//发现a和b都是char类型的，都没有达到一个int的大小
//	//这里就会发生整形提升
//
//	printf("%d\n", c); //-126
		//	char a = 0xb6;
//	short b = 0xb600;
//	int c = 0xb6000000;
//
//	if (a == 0xb6)
//		printf("a");
//	if (b == 0xb600)
//		printf("b");
//	if (c == 0xb6000000)
//		printf("c");
//	char c = 1;
//	printf("%u\n", sizeof(c));//1
//	printf("%u\n", sizeof(+c));//4
//	printf("%u\n", sizeof(-c));//4
//	printf("%u\n", sizeof(!c));//4 gcc - 4

		//算术转换

		//操作符的属性见表

		//宁愿多写几步，也要避免省事一步带来的问题表达式

		char str[] = "hello bit";
		//    //[hello bit\0]
		//    printf("%d %d\n", sizeof(str), strlen(str));
		//    //10 9
		//    //strlen - 函数-求字符串长度的，找\0之前出现的字符个数
		//    //sizeof - 操作符-计算变量/类型所占内存大小，单位是字节
	return 0;
}