#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>
//初识操作符（只是简单了解）

int main()
{
	//简单除法 /
	int a = 9 / 2;//int其实是整形赋值
	printf("%d\n", a);//此处输出整形故为4

	float a0 = 9 / 2;
	printf("%f\n", a0);//即使此处用了f表达单精度浮点数但由于9/2为整形相除故结果依旧没有小数点后
	
	float a1 = 9 / 2.0;
	printf("%f\n", a1);//只有这样才能得到小数

	//取模（余数） %
	int b = 9 % 2;
	printf("%d\n", b);

	//移位操作符 << >>
	int c = 2;
	int d = c << 1;
	printf("%d\n", d);//二进制中数字向左移一个单位 
	                  //例如2-00000000000000000000000000000010
	                  //变为4-00000000000000000000000000000100
	                  //注意整形32个比特位即4个字节
	                  //二进制的一位叫做1比特
	                  
	//位操作符：
	//& 按位与
	//| 按位或
	//^按位异或

	//赋值操作符
	int e = 2;
	e = e + 5;
	e += 5;//以上三种表达意义一致其中+=叫赋值操作符
	       //还有= += -= /= &= ^= |= %=

	//单目操作符
//！逻辑反操作
	int f = 10;
	printf("%d\n", !f);//0表示假，非零表示真，逻辑取反就是真假互换
	               //10即转为0 默认0转为1
	if (e)
	{
		printf("hh\n");//如果f为真做执行
	}
	if(!e)
	{
		printf("hehe\n");//如果f为假执行
	}
//sizeof是一个操作符，计算类型或变量的大小
	int g = 7;
	printf("%d\n", sizeof(int));
	printf("%d\n", sizeof(g));
	printf("%d\n", sizeof g);//括号可以在一般情况下省略但一般不省略
	int arr[10] = { 1,2,3,4,5,6,7,8,9,10 };
	printf("%d", sizeof(arr));//计算的数组总大小，单位是字节
	printf("%d", sizeof(arr[1]));//计算的数组中的某一个，单位是字节
	//计算数组元素个数
	int sz = sizeof(arr) / sizeof(arr[0]);
	printf("%d\n", sz);
	
       //~按位取反  位即二进制位
	int m = 0;
	printf("%d\n", ~m);//0的二进制00000000000000000000000000000000
                       //按位取反 11111111111111111111111111111111
	                   //整数在内存中存储的是补码，一个整数二进制有三种：原码，反码，补码
	                   //对于正整数三码相同（补码存于内存）
	                   //对于负整数以补码存于内存
	                   //例如-1
	                   //10000000000000000000000000000001原码
	                   //11111111111111111111111111111110反码
	                   //11111111111111111111111111111111补码（存于计算机中）
	                   //第一位代表正负（正为0）

	//前++ 后++
	int A = 10;
	int B = ++A;
	printf("%d\n", B);
	printf("%d\n", A);//前++先++后使用
	int A1 = 10;
	int B1 = A1++;
	printf("%d\n", B1);
	printf("%d\n", A1);//后++先使用后++

	int C = 3.14;
	printf("d\n", C);//会有警报因为定义类型不一致可以把=后改为（int）3.14

	//&&逻辑与 ||逻辑或（结合数学命题理解）利用真假
	int M = 3;
	int N = 5;
	int D = M && N;
	printf("%d\n", D);//&&中只有真真为1其余都为0
	                  //||中只有假假为0其余都为1
	
	//三目操作符
	int a = 0;
	int b = 3;
	int max;
	if (a > b)
		max = a;
	else
		max = b;
	max = a > b ? a : b;//等同于上面的if语句
  //表达式1，2，3
	
  
    //逗号表达式
	int d = (a = b + 2, c = a - 4, b = c + 2);//逗号表达式会从右向左运算，d输出的是最后一个表达式的结果

	//[]为下标引用例arr[1]
	//（）为函数调用例if（）
	return 0;
}